televizor_info = [
    ('Sony', 'Foxconn', 50000, 1-2-2023, 'Есть', 'Василий', 5000),
    ('Lg', 'SweedenFactory', 40000, 2-3-2023, 'Есть', 'Владимир', 4500),
    ('Hisense', 'ChinaFactory', 30000, 3-2-2023, 'Нет', 'Алиса', 3700),
    ('EVOLUTION', 'ChinaFactory', 37000, 4-3-2023, 'Нет', 'Василий', 2800),
    ('Samsung', 'USAFactory', 80000, 3-3-2023, 'Есть', 'Андрей', 3200),
    ('Xiaomi', 'China', 45000, 4-3-2023, 'Есть', 'Андрей', 1700),
    ('Sony', 'Foxconn', 50000, 1-2-2023, 'Есть', 'Василий', 3400),
    ('KIVI', 'ChinaFactory', 67000, 5-3-2023, 'Нет', 'Максим', 4700),
    ('Polarine', 'ChineFactory', 32000, 2-6-2023, 'Нет', 'Василий', 2800),
    ('Haier', 'USAFactory', 46000, 6-3-2023, 'Есть', 'Владимир', 3300),
]