'''Организовать словарь на 10 англо-русских слов, обеспечивающий
”перевод” английского слова на русский.'''

dictionary = {
    "cat": "кот",
    "dog": "собака",
    "book": "книга",
    "tree": "дерево",
    "water": "вода",
    "sun": "солнце",
    "moon": "луна",
    "star": "звезда",
    "car": "машина",
    "flower": "цветок"
}


word = input("Введите английское слово: ")

if word in dictionary:
    print("Перевод:", dictionary[word])
else:
    print("Слово не найдено в словаре")
